<?
// В PHP существуют различные escape-последовательности, которые можно использовать для вывода специальных символов. Ниже приведены несколько примеров различных вариаций escape-последовательностей:

// 1. Escape последовательность для вывода обратного слэша: \\
echo "Это обратный слэш: \\";


// 2. Escape последовательность для вывода одинарной кавычки: \'
echo 'Это одинарная кавычка: \'';


// 3. Escape последовательность для вывода двойной кавычки: \"
echo "Это двойная кавычка: \"";


// 4. Escape последовательность для вывода символа новой строки: \n
echo "Это строка 1\nЭто строка 2";


// 5. Escape последовательность для вывода символа табуляции: \t
echo "Это текст с\tтабуляцией";


// 6. Escape последовательность для вывода символа возврата каретки: \r
echo "Это текст с\rвозвратом каретки";


// 7. Escape последовательность для вывода символа возврата каретки и перехода на новую строку: \r\n
echo "Это текст с\r\nвозвратом каретки и переходом на новую строку";


// 8. Escape последовательность для вывода символа забоя: \b
echo "Это текст с\bсимволом забоя";


// 9. Escape последовательность для вывода символа нулевого байта: \0
echo "Это текст с\0символом нулевого байта";


// 10. Escape последовательность для вывода символа Unicode: \u{XXXX}
echo "Это символ Unicode: \u{00A9}";


// Каждая из этих escape-последовательностей позволяет вывести специальные символы в строке, которые были бы иначе интерпретированы PHP.